import React from 'react';
import './subcontent.css'
import Sub1 from '../img/img_8.png'
import Sub2 from '../img/img_9.png'
const Subcontent = () => {
    return (
        <>
            <div className="sub-container">
            <section className="subcontent">
                <div className="container">
                    <div className="subcontent_row">
                        <div className="subcontent_text">
                            <div className="text_text">
                                <div>
                                    <svg width="42" height="53" viewBox="0 0 42 53" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M0.03125 26.7998C0.03125 18.3998 1.80725 11.9678 5.35925 7.50384C8.91125 2.99184 13.9753 0.73584 20.5513 0.73584C24.1033 0.73584 27.1753 1.35984 29.7673 2.60784C32.3593 3.85584 34.4952 5.63184 36.1753 7.93584C37.9033 10.1918 39.1753 12.9278 39.9912 16.1438C40.8073 19.3118 41.2153 22.8638 41.2153 26.7998C41.2153 35.1998 39.4152 41.6558 35.8153 46.1678C32.2633 50.6318 27.1753 52.8638 20.5513 52.8638C17.0473 52.8638 13.9993 52.2398 11.4073 50.9918C8.86325 49.7438 6.72725 47.9918 4.99925 45.7358C3.31925 43.4318 2.07125 40.6958 1.25525 37.5278C0.43925 34.3118 0.03125 30.7358 0.03125 26.7998ZM6.36725 26.7998C6.36725 29.5838 6.63125 32.2238 7.15925 34.7198C7.73525 37.2158 8.59925 39.4238 9.75125 41.3438C10.9033 43.2158 12.3673 44.7278 14.1433 45.8798C15.9673 46.9838 18.1033 47.5358 20.5513 47.5358C25.0153 47.5358 28.5193 45.8558 31.0633 42.4958C33.6073 39.0878 34.8792 33.8558 34.8792 26.7998C34.8792 24.0638 34.5912 21.4478 34.0152 18.9518C33.4872 16.4078 32.6233 14.1998 31.4233 12.3278C30.2713 10.4078 28.7833 8.89584 26.9593 7.79184C25.1833 6.63984 23.0473 6.06384 20.5513 6.06384C16.1353 6.06384 12.6553 7.76784 10.1112 11.1758C7.61525 14.5358 6.36725 19.7438 6.36725 26.7998Z"
                                            fill="#FE5B00"/>
                                    </svg>
                                </div>
                                <div>
                                    <p>
                                        <span>range</span> – казахская торговая марка. Главный офис и основное
                                        производство
                                        расположены в столице Астана. Собираем компьютеры на любой вкус
                                    </p>
                                </div>
                            </div>
                            <p className="end_subcontent">Мы предлагаем качественную продукцию казахского производства,
                                которая полностью
                                адаптирована к реалиям мирового рынка.</p>
                        </div>


                        <div className="subcontent_adv">
                            <div className="subcontent_sub">
                                <img src={Sub1} width="48.5" height="45.5" alt=""/>
                                    <div>
                                        <h2>Cобственное производство</h2>
                                        <p>Выский уровнень технологий позволяет гарантировать качество продукции на
                                            протяжении 10
                                            лет</p>
                                    </div>
                            </div>

                            <div className="subcontent_sub">
                                <img src={Sub2} width="44.5" height="60" alt=""/>
                                    <div>
                                        <h2>Экологичность и доступность</h2>
                                        <p>Уникальный состав сплава делает продукцию Orange безопасной для
                                            потребителя</p>
                                    </div>
                            </div>
                        </div>
                    </div>
                </div>
            </section>
            </div>
        </>
    );
};

export default Subcontent;