import {Component} from 'react'
import './footer.css'
import React from 'react';

const Footer = () => {
    return (
        <div className="footer">
            <div className="container">
                <div className="footer_row">
                    <svg width="126" height="35" viewBox="0 0 126 35" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M1.1582 11.2904L11.4399 1.14258C9.09908 2.02471 6.97329 3.38458 5.20153 5.13328C3.42978 6.88197 2.05197 8.9801 1.1582 11.2904Z"
                            fill="#F5702C"/>
                        <path
                            d="M17.7503 0C16.9118 0.00124832 16.0744 0.0600794 15.2442 0.176067L0.17947 15.0457C0.0604284 15.8646 0.000454142 16.6909 0 17.5181C0 17.6793 0.00756802 17.8383 0.0118926 17.9994L18.2379 0.0117378C18.0757 0.00746951 17.9135 0 17.7503 0Z"
                            fill="#F5702C"/>
                        <path
                            d="M23.0843 0.806722C22.3385 0.575973 21.5778 0.394875 20.8074 0.264648L0.265625 20.539C0.397689 21.2994 0.581174 22.0501 0.814847 22.7863L23.0843 0.806722Z"
                            fill="#F5702C"/>
                        <path
                            d="M26.9724 2.54826C26.3759 2.19232 25.7586 1.87163 25.1236 1.58789L1.60547 24.7967C1.8925 25.4233 2.21743 26.0323 2.5785 26.6204L26.9724 2.54826Z"
                            fill="#F5702C"/>
                        <path
                            d="M30.1505 4.99003C29.6713 4.5292 29.1659 4.09562 28.6369 3.69141L3.74023 28.2682C4.15043 28.7902 4.59007 29.289 5.05707 29.7621L30.1505 4.99003Z"
                            fill="#F5702C"/>
                        <path
                            d="M32.6891 8.06299C32.3236 7.50229 31.9266 6.96222 31.4999 6.44531L6.52539 31.0947C7.04904 31.5164 7.59662 31.9083 8.16549 32.2685L32.6891 8.06299Z"
                            fill="#F5702C"/>
                        <path
                            d="M34.5337 11.8198C34.3002 11.1456 34.0247 10.4864 33.7088 9.8457L9.97656 33.269C10.6263 33.5802 11.2946 33.852 11.9778 34.0832L34.5337 11.8198Z"
                            fill="#F5702C"/>
                        <path
                            d="M35.4625 16.4801C35.4144 15.6498 35.306 14.8239 35.1382 14.0088L14.1953 34.6801C15.0204 34.8456 15.8565 34.9526 16.6971 35.0003L35.4625 16.4801Z"
                            fill="#F5702C"/>
                        <path
                            d="M34.6573 22.8548C35.029 21.7078 35.2794 20.526 35.4044 19.3281L19.584 34.9426C20.7977 34.8196 21.9952 34.5725 23.1572 34.2053L34.6573 22.8548Z"
                            fill="#F5702C"/>
                        <path
                            d="M52.0926 24.5854C51.1501 24.5906 50.216 24.4112 49.3443 24.0577C48.4725 23.7041 47.6805 23.1833 47.0141 22.5255C46.3478 21.8677 45.8202 21.0859 45.4621 20.2255C45.104 19.365 44.9224 18.443 44.9279 17.5128C44.9279 13.5646 48.0902 10.3848 52.0926 10.3848C56.095 10.3848 59.2584 13.5625 59.2584 17.5128C59.2637 18.4431 59.082 19.3651 58.7238 20.2255C58.3655 21.086 57.8379 21.8678 57.1714 22.5255C56.505 23.1833 55.7129 23.7041 54.8411 24.0577C53.9693 24.4112 53.0351 24.5906 52.0926 24.5854ZM52.0926 12.504C49.2211 12.504 47.248 14.7651 47.248 17.4851C47.248 20.2328 49.2211 22.4662 52.0926 22.4662C54.9641 22.4662 56.9372 20.2328 56.9372 17.4851C56.9372 14.7651 54.9641 12.504 52.0926 12.504Z"
                            fill="#F5702C"/>
                        <path
                            d="M68.6252 24.2127L65.5223 18.5722H64.5925V24.2127H62.2734V10.7559H64.8249C67.4359 10.7559 70.2501 11.4153 70.2501 14.6496C70.2501 16.5405 69.0317 17.6556 67.784 18.1144L71.4102 24.2127H68.6252ZM64.8249 12.8751H64.5925V16.5682L64.8541 16.5405C66.624 16.5405 67.8424 16.2822 67.8424 14.736C67.8132 13.0757 66.6823 12.8751 64.8249 12.8751Z"
                            fill="#F5702C"/>
                        <path
                            d="M82.3464 24.2127L81.0718 21.2345H75.5882L74.3406 24.2127H71.7891L77.9386 10.7559H78.7505L84.8709 24.2127H82.3464ZM78.3148 14.7937H78.2575L76.3428 19.4312H80.2879L78.3148 14.7937Z"
                            fill="#F5702C"/>
                        <path
                            d="M97.9515 24.2127L89.3651 15.0796V24.2127H87.0449V10.7559H88.205L96.7623 19.9466V10.7559H99.0835V24.2127H97.9515Z"
                            fill="#F5702C"/>
                        <path
                            d="M109.087 24.5853C105.026 24.5853 102.096 21.2923 102.096 17.5426C102.096 13.6777 105.026 10.3857 109.203 10.3857C111.727 10.3857 113.496 11.4443 115.265 13.5635L113.526 15.0809C112.161 13.3053 111.03 12.5049 109.174 12.5049C106.331 12.5049 104.474 14.8803 104.503 17.5426C104.503 20.1196 106.505 22.4383 109.087 22.4383C111.142 22.4383 112.916 21.0074 113.176 19.1752H109.176V17.0549H115.731C115.732 21.3499 113.529 24.5853 109.087 24.5853Z"
                            fill="#F5702C"/>
                        <path
                            d="M118.777 24.2127V10.7559H126V12.8751H121.099V15.9696H126V18.0888H121.099V22.0967H126V24.2159L118.777 24.2127Z"
                            fill="#F5702C"/>
                    </svg>

                    <div className="footer_links">
                        <ul>
                            <li className="footer_item">
                                <div>
                                    <svg width="7" height="12" viewBox="0 0 7 12" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <path d="M1 1L6 6L1 11" stroke="#EC7133" stroke-width="2" stroke-linecap="round"
                                              stroke-linejoin="round"/>
                                    </svg>
                                    <a href="src/components/footer#">
                                        О компании
                                    </a>
                                </div>
                            </li>
                            <li className="footer_item">
                                <div>
                                    <svg width="7" height="12" viewBox="0 0 7 12" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <path d="M1 1L6 6L1 11" stroke="#EC7133" stroke-width="2" stroke-linecap="round"
                                              stroke-linejoin="round"/>
                                    </svg>
                                    <a href="src/components/footer#">
                                        Сотрудничество
                                    </a>
                                </div>
                            </li>
                            <li className="footer_item">
                                <div>
                                    <svg width="7" height="12" viewBox="0 0 7 12" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <path d="M1 1L6 6L1 11" stroke="#EC7133" stroke-width="2" stroke-linecap="round"
                                              stroke-linejoin="round"/>
                                    </svg>
                                    <a href="src/components/footer#">
                                        Покупателям
                                    </a>
                                </div>
                            </li>
                        </ul>
                    </div>


                    <div className="footer_links">
                        <ul>
                            <li className="footer_item">
                                <div>
                                    <svg width="7" height="12" viewBox="0 0 7 12" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <path d="M1 1L6 6L1 11" stroke="#EC7133" stroke-width="2" stroke-linecap="round"
                                              stroke-linejoin="round"/>
                                    </svg>
                                    <a href="src/components/footer">
                                        Где купить
                                    </a>
                                </div>
                            </li>
                            <li className="footer_item">
                                <div>
                                    <svg width="7" height="12" viewBox="0 0 7 12" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <path d="M1 1L6 6L1 11" stroke="#EC7133" stroke-width="2" stroke-linecap="round"
                                              stroke-linejoin="round"/>
                                    </svg>
                                    <a href="src/components/footer">
                                        Сервисное обслуживание
                                    </a>
                                </div>
                            </li>
                            <li className="footer_item">
                                <div>
                                    <svg width="7" height="12" viewBox="0 0 7 12" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <path d="M1 1L6 6L1 11" stroke="#EC7133" stroke-width="2" stroke-linecap="round"
                                              stroke-linejoin="round"/>
                                    </svg>
                                    <a href="src/components/footer">
                                        Контакты
                                    </a>
                                </div>
                            </li>
                        </ul>
                    </div>


                    <div className="footer_links">
                        <ul>
                            <li className="footer_bold_text">
                                Есть вопросы?
                            </li>
                            <li className="footer_item">
                                <div>
                                    <svg width="20" height="20" viewBox="0 0 20 20" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M17.4993 4.16699H2.49935C2.03911 4.16699 1.66602 4.54009 1.66602 5.00033V15.8337C1.66602 16.2939 2.03911 16.667 2.49935 16.667H17.4993C17.9596 16.667 18.3327 16.2939 18.3327 15.8337V5.00033C18.3327 4.54009 17.9596 4.16699 17.4993 4.16699Z"
                                            stroke="#F5702C" stroke-width="1.6" stroke-linejoin="round"/>
                                        <path d="M3 5.5L10 11.6667L17 5.5" stroke="#F5702C" stroke-width="1.6"
                                              stroke-linecap="round" stroke-linejoin="round"/>
                                    </svg>
                                    <a href="src/components/footer">hello@orangemixers.ru</a>
                                </div>
                            </li>
                            <li className="footer_item">
                                <div>
                                    <svg width="20" height="20" viewBox="0 0 20 20" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M14.75 1.25H5.25C4.55937 1.25 4 1.80937 4 2.5V17.5C4 18.1906 4.55937 18.75 5.25 18.75H14.75C15.4406 18.75 16 18.1906 16 17.5V2.5C16 1.80937 15.4406 1.25 14.75 1.25ZM10 17.5C9.655 17.5 9.375 17.22 9.375 16.875C9.375 16.53 9.655 16.25 10 16.25C10.345 16.25 10.625 16.53 10.625 16.875C10.625 17.22 10.345 17.5 10 17.5ZM14.75 15.625H5.25V3.125H14.75V15.625Z"
                                            fill="#F5702C"/>
                                    </svg>
                                    <a href="src/components/footer#">+7 (495) 543 23 45</a>
                                </div>
                            </li>
                        </ul>
                    </div>


                    <div className="footer_links">
                        <ul>
                            <li className="footer_bold_text">Мы в соцсетях</li>
                            <li className="footer_item">
                                <div><a href="src/components/footer#">
                                    <svg width="38" height="38" viewBox="0 0 38 38" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <path fill-rule="evenodd" clip-rule="evenodd"
                                              d="M19 1C14.1115 1 13.4985 1.02072 11.5786 1.10832C9.66273 1.1957 8.35425 1.50002 7.20932 1.94501C6.02566 2.40494 5.02184 3.02042 4.0211 4.0211C3.02042 5.02184 2.40494 6.02566 1.94501 7.20932C1.50002 8.35425 1.1957 9.66273 1.10832 11.5786C1.02072 13.4985 1 14.1115 1 19C1 23.8885 1.02072 24.5015 1.10832 26.4214C1.1957 28.3373 1.50002 29.6458 1.94501 30.7907C2.40494 31.9744 3.02042 32.9782 4.0211 33.9789C5.02184 34.9796 6.02566 35.5951 7.20932 36.0551C8.35425 36.5 9.66273 36.8043 11.5786 36.8917C13.4985 36.9793 14.1115 37 19 37C23.8885 37 24.5015 36.9793 26.4214 36.8917C28.3373 36.8043 29.6458 36.5 30.7907 36.0551C31.9743 35.5951 32.9782 34.9796 33.9789 33.9789C34.9796 32.9782 35.5951 31.9744 36.0551 30.7907C36.5 29.6458 36.8043 28.3373 36.8917 26.4214C36.9793 24.5015 37 23.8885 37 19C37 14.1115 36.9793 13.4985 36.8917 11.5786C36.8043 9.66273 36.5 8.35425 36.0551 7.20932C35.5951 6.02566 34.9796 5.02184 33.9789 4.0211C32.9782 3.02042 31.9743 2.40494 30.7907 1.94501C29.6458 1.50002 28.3373 1.1957 26.4214 1.10832C24.5015 1.02072 23.8885 1 19 1Z"
                                              stroke="#FE5B00" stroke-width="2"/>
                                        <path
                                            d="M19.0078 26.9941C23.4261 26.9941 27.0078 23.4124 27.0078 18.9941C27.0078 14.5759 23.4261 10.9941 19.0078 10.9941C14.5895 10.9941 11.0078 14.5759 11.0078 18.9941C11.0078 23.4124 14.5895 26.9941 19.0078 26.9941Z"
                                            stroke="#FE5B00" stroke-width="2"/>
                                        <path
                                            d="M31.0078 8.49414C31.0078 9.32257 30.3362 9.99414 29.5078 9.99414C28.6794 9.99414 28.0078 9.32257 28.0078 8.49414C28.0078 7.66571 28.6794 6.99414 29.5078 6.99414C30.3362 6.99414 31.0078 7.66571 31.0078 8.49414Z"
                                            fill="#333333" stroke="#FE5B00" stroke-width="2"/>
                                    </svg>
                                </a>
                                </div>
                            </li>
                        </ul>
                    </div>
                </div>

                <div className="text_row">
                    <div>
                        <p>© 2023 ky1e WebDev</p>
                    </div>
                    <div className="text_border">
                        <p className="">Разработано by ky1e</p>
                    </div>
                </div>
            </div>
            <hr/>
                <div className="svg_bottom">
                    <button>
                        <svg width="42" height="18" viewBox="0 0 42 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M39.666 16L20.9993 2L2.33264 16" stroke="#484848" stroke-width="4"
                                  stroke-linecap="round" stroke-linejoin="round"/>
                        </svg>
                    </button>
                </div>
        </div>
    )
}

export default Footer